print("Ввидите радиус круга в см")
a=float(input())
b=2*3.14*a # нашел длину в см
c=b/100 # нашел длину в м
d=3.14*(a)**2 # нашел площадь в см
s=d/10000 # нашел площадь в м
print("Длина в см =",b, ".Длина в м =",c, ".Площадь в см =",d, ".Площадь в м =",s)
g=a/2 # нашел длину вписанного квадрата в см
h=g/100 # нашел длину вписанного квадрата в м
f=a*(3)**0.5/6 # нашел длину вписанного треугольника в см
k=f/100 # нашел длину вписанного треугольника в м
print("Длина стороны впис квадрата в см =",g, ".Длина стороны впис квадрата в м =",h, ".Длина стороны впис треугольника см =",f, ".Длина стороны впис треугольника в м =",k)
q=2*a # нашел длину описанного квадрата в см
w=q/100 # нашел длину описанного квадрата в м
e=a*(3)**0.5/3 # нашел длину описанного треугольника в см
r=e/100 # нашел длину описанного треугольника в м
t=2*a*((2**0.5)-1) # нашел длину описанного восьмиугольника в см
y=2*a*((2**0.5)-1)/100 # нашел длину описанного восьмиугольника в м
print("Длина стороны  опис квадрата в см =",q, ".Длина стороны опис квадрата в м =",w, ".Длина стороны опис треугольника см =",e, ".Длина стороны опис треугольника в м =",r, ".Длина стороны опис восьмиугольника в см =",t, ".Длина стороны опис восьмиугольника в м =",y )
